---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.AdditionalElementsRequired
source: html/1a1ca698-adf9-d982-b30b-5a5d1af6a7e0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.AdditionalElementsRequired Property

Grouping the selected elements requires that additional element(s) also be grouped. [Description]
 To satisfy the grouping requirement, these additional element(s) will be automatically added to the group as well.

## Syntax (C#)
```csharp
public static FailureDefinitionId AdditionalElementsRequired { get; }
```